artifacts/oscar_e2e/fig4_right_qwen3_4b_thinking_replay/bf16/in100000_bs32/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31300, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=100000, random_output_len=1000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31300/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31300, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='Qwen/Qwen3-4B-Thinking-2507', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=100000, random_output_len=1000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 3200000
#Output tokens: 32000
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  575.79    
Total input tokens:                      3200000   
Total input text tokens:                 3200000   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    32000     
Request throughput (req/s):              0.06      
Input token throughput (tok/s):          5557.60   
Output token throughput (tok/s):         55.58     
Peak output token throughput (tok/s):    88.00     
Peak concurrent requests:                32        
Total token throughput (tok/s):          5613.18   
Concurrency:                             17.96     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   323216.68 
Median E2E Latency (ms):                 321813.33 
P90 E2E Latency (ms):                    568615.33 
P99 E2E Latency (ms):                    575747.19 
---------------Time to First Token----------------
Mean TTFT (ms):                          267056.99 
Median TTFT (ms):                        265538.94 
P99 TTFT (ms):                           527550.81 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          56.22     
Median TPOT (ms):                        57.27     
P99 TPOT (ms):                           67.46     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           56.22     
Median ITL (ms):                         46.28     
P95 ITL (ms):                            49.47     
P99 ITL (ms):                            49.76     
Max ITL (ms):                            19406.52  
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [01:11<36:58, 71.57s/it]
 16%|█▌        | 5/32 [02:22<11:37, 25.84s/it]
 28%|██▊       | 9/32 [03:34<08:13, 21.45s/it]
 41%|████      | 13/32 [04:45<06:17, 19.85s/it]
 53%|█████▎    | 17/32 [05:58<04:48, 19.20s/it]
 66%|██████▌   | 21/32 [07:13<03:29, 19.04s/it]
 78%|███████▊  | 25/32 [08:24<02:10, 18.63s/it]
 91%|█████████ | 29/32 [09:35<00:55, 18.37s/it]
100%|██████████| 32/32 [09:35<00:00, 17.99s/it]